{"data": 
[
{"label": "greeting",
   "patterns": ["Hi", "Hey", "Is anyone there?", "Hello", "Hay"],
   "responses": ["Hello", "Hi", "Hi there", "Hey"]},

  {"label": "Visa and Entry Requirements",
   "patterns": ["What are the visa requirements for visiting Egypt?", "How do I obtain a tourist visa for Egypt?", "Are there any entry restrictions or requirements due to COVID-19?"],
   "responses": ["On Arrival:$27 (up to 30 days) or $62 (up to 90 days),By Mail:$62 for single entry,In Person:$70 for single entry,E-Visa:$25 for a single-entry","As of the latest information available, there are no mandatory COVID-19 vaccination or testing requirements for entering Egypt. However, travelers should still monitor official sources for potential updates, especially since global pandemic policies evolve rapidly. It is essential to adhere to general hygiene measures and follow any advice provided by local authorities"]},

  {"label": "Safety and Security",
   "patterns": ["Is Egypt a safe destination for tourists?", "Are there any specific safety precautions I should be aware of?","What areas should I avoid as a tourist?"],
   "responses": ["The Egyptian government has taken steps to improve security in recent years, and the overall threat level has decreased.", "maintaining situational awareness and following local recommendations can greatly reduce the chances of experiencing issues while traveling in Egypt.", "Some tips for staying safe in Egypt include:Monitor local news sources for potential dangers and adjust plans accordingly.Avoid crowded places, political demonstrations, and large gatherings.Keep valuables secure and avoid carrying excessive cash.Wear modest clothing, especially in religious sites and rural areas.Be cautious of scams and aggressive solicitations, especially in tourist areas.Hire reputable drivers and use established transport companies.Report crimes promptly to the Tourist Police or local police stations.Learn basic Arabic phrases to communicate effectively.Show respect for local customs, traditions, and religious beliefs."]},

  {"label": "Transportation",
   "patterns": ["What are the transportation options available within Egypt?","How do I get from the airport to my accommodation?","Are there any recommended modes of transportation for traveling between cities or attractions?"],
   "responses": ["Travelers in Egypt have access to a variety of transportation options:Land transportation: Buses, microbuses, taxis, rental cars,Waterway transportation,Airway transportation,Railroad transportation,Metropolitan transportation","Egypt offers a diverse range of transportation options, catering to various budgets, travel styles, and distances. Here's a breakdown:Domestic Flights,Trains,Buses,Shared Taxis (Servees),Private Taxis,Local Transportation,","Transportation options in Egypt:For long distances:Flights: Fast & convenient, best for major cities. Pre-book for deals.Trains: Affordable & comfortable, sleeper trains available. Consider class & women-only carriages.For shorter distances:Buses: Budget-friendly, air-conditioned options available. Comfort varies.Shared taxis: Flexible & affordable, negotiate fares. Can be crowded.Other options:Private taxis: Convenient & comfortable, negotiate fares & use reputable companies.Metro: Efficient & affordable in Cairo & Alexandria.Microbus: Cheap but crowded, serves specific routes in cities.Felucca: Scenic & leisurely sailboat cruises on the Nile.Choose based on:Distance: Flights/trains for long, buses/taxis for short.Budget: Buses & shared taxis cheapest, flights & private taxis most expensive.Comfort: Trains & private taxis more comfortable.Time: Flights fastest, buses & shared taxis slower.Experience: Trains, feluccas, camel rides offer unique experiences."]},

  {"label": "Accommodation",
   "patterns": ["What are some recommended hotels or accommodations in cairo?","Are there any budget-friendly options available?", "How can I book accommodation in advance?"],
   "responses": ["I suggest the following highly regarded hotels in Cairo:The Nile Ritz-Carlton,Kempinski Nile Hotel Cairo,Steigenberger El Tahrir Plaza,Le Méridien Pyramids", " Sure, here are some hotel options in Cairo, Egypt:The Square Boutique Hotel - 3-star hotel for EGP 1,731 per night.Cairo Paradise Hotel - 3-star hotel for EGP 564 per night.Horizon Shahrazad - 4-star hotel for EGP 2,258 per night.Flamenco Cairo Hotel - 4-star hotel for EGP 3,492 per night.Holy Sheet Hostel - Hostel for EGP 836 per night.These are just a few of the many great hotels in Cairo. When making your decision, consider your budget, desired location, and amenities.","Budget-friendly:Cairo Paradise Hotel,Mid-range:The Square Boutique Hotel,Horizon Shahrazad,Luxury:Flamenco Cairo Hotel,Unique:Holy Sheet Hostel","To book accommodation in advance, consider the following guidelines:High season and popular destinations: Book several months in advance to secure desirable lodgings.Festivals and special events: Book well in advance to guarantee availability.Last-minute deals: Look for promotional rates close to departure, but be prepared for limited choices.Luxury accommodations: Search for deals and book in advance to secure discounts.Short stays: Book in advance to maximize time spent exploring the destination.Longer stays: Utilize websites like Airbnb for extended stays, allowing greater flexibility in booking.","There are several ways to book accommodation in advance, here are a few popular options:Online booking platforms:Websites: Popular choices include Booking.com, Expedia, Agoda, Hostelworld (for hostels), Airbnb (for rentals). These platforms offer a wide selection of properties, user reviews, and secure payment options.App: Most of these platforms also have user-friendly mobile apps for convenient booking on the go.Hotel websites:Many hotels have their own websites where you can book directly. This can sometimes offer better deals or packages than third-party platforms. Look for the Book Now or Reservations section on the hotel's website.Contacting the accommodation directly:You can email or call the hotel or rental owner directly to inquire about availability and rates. This can be helpful if you have specific needs or want to negotiate a better price."]},

  {"label": "Tourist Attractions",
  "patterns": ["What are the must-visit attractions in Egypt?","Can you recommend any guided tours or experiences?", "Are there any lesser-known attractions or hidden gems worth exploring?"],
   "responses": ["Some must-visit attractions in Egypt include:Pyramids of Giza,Luxor's Temples & Tombs,Cruising the Nile,Aswan,Abu Simbel,Diving the Red Sea,Explore Historic Cairo,South Sinai's Beach Life,Saqqara,Egyptian Museum,White Desert,Alexandria,Abydos Temple,Siwa Oasis,St. Catherine's Monastery,Red Sea Beaches,Coptic Cairo,Wadi Al-Hitan,Temple of Hathor,Monastery of St. Anthony","Must-visit attractions in Egypt:Iconic Landmarks:Pyramids of Giza & Great Sphinx: Witness awe-inspiring ancient structures, including the Great Pyramid, a Wonder of the World. Marvel at the enigmatic Sphinx guarding them.Ancient Treasures:Valley of the Kings & Luxor Temple: Explore pharaohs' tombs and the majestic Luxor Temple dedicated to the god Amun.Egyptian Museum: See the treasures of Tutankhamun, mummies, and artifacts offering a glimpse into ancient Egyptian life.Natural Wonders:White Desert: Experience otherworldly rock formations sculpted by wind and sand, creating a lunar landscape.Red Sea Riviera: Dive into a vibrant underwater world teeming with colorful marine life in coral reefs.Cultural Gems:Siwa Oasis: Relax in natural hot springs, explore ancient ruins, and experience the unique Berber culture in this desert haven.Aswan & Philae Temple: Cruise the Nile, visit the charming town of Aswan, and see the relocated Philae Temple.Alexandria Library: Delve into the vast collection of books and exhibits at this modern revival of the ancient library.Al-Azhar Mosque: Immerse yourself in Islamic architecture and culture at this prestigious university and mosque."]},

  {"label": "Cultural Etiquette",
   "patterns": ["What are some cultural norms and etiquette I should be aware of in Egypt?", "Is there a specific dress code I should follow when visiting religious sites?", "Are there any customs or traditions I should observe during my visit?"],
   "responses": ["Here are some essential cultural norms and etiquette recommendations for visiting Egypt:Dress modestly: Cover knees and shoulders, particularly when visiting religious sites or rural areas. Women should avoid revealing clothing.Shoes removal: Remove shoes before entering homes, mosques, and some businesses.Table manners: Wait for the host or hostess to indicate seating; eat with the right hand only; take seconds if offered; leave a small amount of food uneaten to show appreciation.Gift giving: Bring chocolate, sweets, or pastries for the hostess; avoid flowers, which are reserved for weddings or funerals.Meeting people: Follow the lead of the individual regarding greetings; handshakes are standard for individuals of the same sex; greetings between men and women involve the woman extending her hand first.Use the right hand: Use the right hand for exchanging money, accepting gifts, and eating; avoid using the left hand for these actions, as it is associated with unclean tasks.Public displays of affection: Keep intimate behavior discreet; avoid holding hands or kissing in public spaces.Religious sensitivity: Respect religious sensitivities, especially during Ramadan; refrain from eating, drinking, or smoking in public during daylight hours.Tipping: Tip generously in restaurants, cafes, and taxis; round up bills to the nearest whole number.Punctuality: Be flexible with time expectations; Egyptians value relationships above adherence to strict timelines.","Here are some key points to remember:Dress modestly:Both men and women should dress modestly, especially outside major tourist areas. Opt for loose-fitting clothing that covers shoulders and knees.Women may receive unwanted attention if dressed revealingly. Consider scarves or shawls for additional coverage.Greetings and interactions:A handshake is the common greeting for both men and women. Wait for the woman to initiate a handshake if unsure.Use titles like Mr. or Madam when addressing someone unless invited to use first names.Public displays of affection are generally frowned upon.Religious sensitivity:Respect Ramadan, the month of fasting, by avoiding eating or drinking in public during the day.Dress modestly when visiting religious sites like mosques and churches.Be mindful of noise and refrain from disruptive behavior near places of worship.Gift-giving:Gifts are not expected but appreciated. If giving, present with two hands or the right hand.Small, thoughtful gifts like local crafts or sweets are suitable. Avoid alcohol or religious items.Photography:Always ask permission before photographing people, especially women and children.Be mindful in religious sites, where photography may be restricted.Bargaining:Bargaining is expected in many markets and bazaars. Be polite and respectful, and start with a lower offer than the asking price.Settle on a fair price without getting frustrated or overly aggressive.Tipping:Tipping is customary in restaurants, taxis, and for services. Leave around 10-15% for good service.Tipping at hotels is optional but appreciated."]},

  {"label": "Food and Dining",
   "patterns": ["What are some traditional Egyptian dishes I should try?", "Can you recommend any restaurants or street food vendors known for authentic cuisine?","Are there any dietary restrictions or considerations I should be aware of?"],
   "responses": ["During your stay in Egypt, be sure to sample some of the country's renowned culinary traditions. Here are some traditional dishes you might enjoy:Ful Medames,Koshari,Mulukhiyah ,Tamiya ,Shawarma,Kofta,Bastilla ,Basboosa,Umm Ali,Fetaer Meshaltet,Hamam Mahshi,Romy Cheese Fondue", "Here are some traditional Egyptian dishes you shouldn't miss:Main Courses:Ful Medames: This hearty breakfast staple consists of mashed fava beans cooked with oil, lemon, and spices. Savory and filling, it's often served with pita bread, vegetables, and cheese.Koshari: A national favorite, this layered dish combines rice, macaroni, lentils, fried onions, chickpeas, and a spicy tomato sauce. It's a vegetarian's delight, full of textures and flavors.Kebab and Kofta: Skewered and grilled meats are popular throughout Egypt. Kofta are spiced ground meat patties, while kebabs use chunks of meat. Both are often served with pita bread, vegetables, and dips.Mulukhiya: This green soup features jute leaves cooked in a meat or chicken broth with garlic, spices, and sometimes cream. It's a hearty and flavorful dish, often served with rice.Mahshi: Various vegetables like peppers, zucchini, and eggplant are stuffed with rice, meat, and spices, creating flavorful and visually appealing dishes.Sides and Snacks:Ta'meya: These falafel-like fritters are made from mashed fava beans, herbs, and spices, offering a crispy and flavorful vegetarian option.Baba ghanoush: This smoky and creamy roasted eggplant dip is a crowd-pleaser, perfect for scooping with pita bread.Hummus: This popular chickpea dip is a staple in Egyptian cuisine, enjoyed with pita bread, vegetables, or even as a spread on sandwiches.Fatteh: Layers of pita bread, crispy fried onions, rice, meat, and a yogurt sauce create a rich and flavorful dish, often enjoyed during special occasions.Umm Ali: This warm bread pudding features flaky pastry, nuts, raisins, and milk, creating a sweet and comforting dessert.Drinks:Hibiscus tea: This vibrant red tea, known as Karkadeh, is a refreshing and slightly tart beverage, enjoyed hot or cold.Coffee: Egyptians love their coffee, strong and often sweetened with sugar. Try a traditional Turkish coffee for a truly authentic experience.Dates: These naturally sweet fruits are a popular snack and ingredient in desserts.","Must-Try Egyptian Eats:Main Courses:Ful Medames: Hearty fava bean breakfast with pita bread and veg.Koshari: National fave - layers of rice, pasta, lentils, onions, chickpeas in spicy sauce.Kebab & Kofta: Skewered & grilled meats - kofta (spiced patties) & kebab (chunks).Mulukhiya: Green soup with jute leaves, broth, spices, sometimes cream.Mahshi: Stuffed veggies (peppers, zucchini, etc.) with rice, meat, and spices.Sides & Snacks:Ta'meya: Falafel-like fava bean fritters.Baba ghanoush: Smoky roasted eggplant dip.Hummus: Classic chickpea dip.Fatteh: Layered pita bread, onions, rice, meat, yogurt sauce.Umm Ali: Warm bread pudding with pastry, nuts, raisins, milk.Drinks:Hibiscus tea (Karkadeh): Refreshing red tea, hot or cold.Coffee: Strong, often sweetened.Dates: Sweet fruit, popular snack and dessert ingredient."]},

  {"label": "Language and Communication",
   "patterns": ["What languages are commonly spoken in Egypt?", "Will I be able to communicate in English in most tourist areas?", "Are there any useful phrases or words I should learn in Arabic?"],
   "responses": ["The primary languages spoken in Egypt are Arabic and Egyptian Arabic. Arabic is the official language and is used in most written documents and schools, while Egyptian Arabic is the most widely spoken language in daily conversations, accounting for about 68% of the population. Other languages spoken in Egypt include Sa'idi Arabic, Sudanese Arabic, Domari, Nobiin, and Bedawi. Educated Egyptians often speak English or French as secondary languages. Additionally, there are minor linguistic groups speaking languages like Greek, Armenian, and Italian.","The languages spoken in Egypt are:Official language:Modern Standard Arabic: This is the formal language used in education, government, and written communication. You will see it on signs, in newspapers, and hear it in official speeches.Spoken languages:Egyptian Arabic: This is the most widely spoken language in Egypt, used by everyday people in their daily lives. It has several regional dialects, with the Cairo dialect being the most widely understood.Other Arabic dialects: Smaller pockets of people speak other Arabic dialects, such as Sa'idi Arabic in Upper Egypt and Bedawi Arabic in the desert regions.Coptic: This is the liturgical language of the Coptic Orthodox Church, an important religious minority in Egypt.Minor languages: Smaller groups speak other languages like Greek, Armenian, Domari (spoken by Roma people), and Nobiin (spoken by Nubians).English and French:English and French are widely understood in tourist areas and by educated Egyptians, especially in major cities like Cairo and Alexandria.", "In Egypt:Official: Modern Standard Arabic (formal, written)Spoken: Egyptian Arabic (widespread, dialects vary), plus smaller communities speak other Arabic dialects like Sa'idi and Bedawi.Religious: Coptic (Coptic Orthodox Church)Minor: Greek, Armenian, Domari, NobiinTourism: English & French understood in some areas","Mainly Arabic and Egyptian Arabic, with some English and French speakers."]},


  {"label": "Weather and Climate",
   "patterns": ["What is the weather in Egypt?", "Are there any seasonal considerations I should be aware of?","What should I pack for my trip considering the climate?"],
   "responses": ["Egypt generally enjoys a warm and dry climate, with distinct seasons:Winter (December–February): Temperatures range from 12°C (54°F) to 18°C (65°F), making it relatively cool compared to the rest of the year. This period sees minimal rainfall.Spring (March–May): Temperatures rise gradually, ranging from 15°C (60°F) to 27°C (81°F). There is also increased likelihood of dust storms due to winds known as the khamaseen.Summer (June–August): Hot and dry conditions prevail, with temperatures averaging 34°C (92°F) and occasionally rising over 40°C (104°F).Autumn (September–November): Temperatures decrease slowly, ranging from 17°C (63°F) to 28°C (82°F). This period brings slight rainfall, primarily in coastal cities such as Alexandria.","Here's your text about Egypt's weather with a different style:Egypt: Sunshine seeker's paradiseEgypt boasts a year-round warm and dry climate, perfect for soaking up the sun and exploring ancient wonders. Let's dive into its distinct seasons:Winter chills (December-February): Think comfy sweaters and mild weather with highs around 18°C (65°F). Rain is rare, making it ideal for outdoor adventures.Spring awakening (March-May): Temperatures blossom, ranging from 15°C (60°F) to 27°C (81°F). Keep an eye out for occasional dust storms brought by the khamaseen winds.Scorching summer (June-August): Brace yourself for the heat! Expect sizzling temperatures averaging 34°C (92°F), sometimes spiking even higher. Seek shade and stay hydrated!Autumn's embrace (September-November): Temperatures take a gentle dip, ranging from 17°C (63°F) to 28°C (82°F). Coastal cities like Alexandria see a touch of rain, but overall, it's still sunny bliss.", "Winter: Cool (12°C – 18°C).Spring: Gradually warming (15°C – 27°C).Summer: Very hot (34°C+).utumn: Pleasant (17°C – 28°C)","When preparing for a trip to Egypt, consider the following suggestions based on the climate:Summer (June–August):Lightweight, loose-fitting clothing,Hats and sunglasses,Sunscreen,Swimsuits for coastal visits,Minimal footwear (flip-flops, sandals).Spring (March–May) and Fall (September–November):Light layers (thin sweaters, cotton long-sleeve tops),Comfortable shoes suitable for walking,Hat and sunscreen,Raincoat or umbrella (especially for coastal cities like Alexandria).Winter (December–February):Thin windproof jackets,Thermal undergarments (if needed),Gloves and hats (for cold nights),Comfortable shoes"]},

  {"label": "Currency and Money Matters",
   "patterns": ["What is the currency used in Egypt, and where can I exchange money?", "Are credit cards widely accepted, or should I carry cash?","Are there any tipping customs I should be aware of?"],
   "responses": ["In Egypt, the official currency is the Egyptian Pound (EGP). You may exchange foreign currency at airports, major hotels, licensed exchange offices, and authorized banks throughout the country. It is recommended to carry smaller bills and coins because larger notes may not always be accepted everywhere. Credit cards are increasingly being accepted in tourist destinations, but carrying cash remains essential for small transactions and street vendors. Keep in mind that exchanging large amounts of currency outside of reputable institutions could expose you to fraudulent activities. Always check the exchange rates beforehand to ensure fairness and accuracy.","The official currency used in Egypt is the Egyptian Pound (EGP). It's abbreviated as £E, LE, or EGP in Latin script and ج.م", "Egypt uses the Egyptian Pound (EGP). Here's your cheat sheet:Before you go:Check: Compare rates at banks, specialists, or online vendors.Consider: Ordering EGP online for pickup upon arrival."]},

  {"label": "thanks",
   "patterns": ["Thanks", "Thank you","That's helpful", "Thanks for the help"],
   "responses": ["Happy to help!","Any time!", "My pleasure","You're most welcome!"]},


  {"label": "goodbye",
   "patterns": ["Bye", "See you later", "Goodbye"],
   "responses": ["See you later", "Have a nice day", "Bye! Come back again"]}]}
